Catalogs/Резюме.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Резюме</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СемейноеПоложение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВодительскиеПрава</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемаяЗарплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГородПроживания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонПроживания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтанцияМетро</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпытИДостижения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Образование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НачалоОбучения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецОбучения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчебноеЗаведение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Специальность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОпытРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НачалоДеятельности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеДеятельности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязанности</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СфераДеятельностиОрганизации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Навыки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПрофНавыки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеСведения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДопСведения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РазмещениеРезюме</Name>
					<Comment>на каких сайтах, в каких агентствах</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МестоРазмещения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРазмещения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>логин</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пароль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Причины</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Причина</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеПричины</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Собеседования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаСобеседования</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеСобеседования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Резюме/Ext/ManagerModule.bsl
//вызывается из модуля формы документа (из серверной процедуры)
Процедура ПечатьРезюме(ТабДок, ПараметрКоманды) Экспорт

	Макет = Справочники.Резюме.ПолучитьМакет("Макет");
	Ссылка = ПараметрКоманды.Ссылка;

	ТабДок.Очистить();
	//ВставлятьРазделительСтраниц = Ложь;
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.Заполнить(Ссылка);
	Шапка.Параметры.ДатаРождения = Формат(Ссылка.ДатаРождения, "ДЛФ=ДД");
	ТабДок.Вывести(Шапка);
	
	Если Ссылка.ОжидаемаяЗарплата<>0 Тогда
		Секция = Макет.ПолучитьОбласть("СекцияЗарплата");
		Секция.Параметры.ОжидаемаяЗарплата = Ссылка.ОжидаемаяЗарплата;
		ТабДок.Вывести(Секция);
	КонецЕсли;
	
	//прог 01 04 12
	Если НЕ ПустаяСтрока(Ссылка.ГородПроживания) Тогда
		ДопСв = Макет.ПолучитьОбласть("ДопСвСтр1");
		ДопСв.Параметры.ДопСвЗагол = "Город проживания";
		ДопСв.Параметры.ДопСвТекст = сокрЛП(Ссылка.ГородПроживания);
		ТабДок.Вывести(ДопСв);
	КонецЕсли;
	Если НЕ ПустаяСтрока(Ссылка.РайонПроживания) Тогда
		ДопСв = Макет.ПолучитьОбласть("ДопСвСтр1");
		ДопСв.Параметры.ДопСвЗагол = "Район проживания";
		ДопСв.Параметры.ДопСвТекст = сокрЛП(Ссылка.РайонПроживания);
		ТабДок.Вывести(ДопСв);
	КонецЕсли;
	Если НЕ ПустаяСтрока(Ссылка.СтанцияМетро) Тогда
		ДопСв = Макет.ПолучитьОбласть("ДопСвСтр1");
		ДопСв.Параметры.ДопСвЗагол = "Станция метро";
		ДопСв.Параметры.ДопСвТекст = сокрЛП(Ссылка.СтанцияМетро);
		ТабДок.Вывести(ДопСв);
	КонецЕсли;
	//прог 01 04 12 конец
	
	Разделитель = Макет.ПолучитьОбласть("Разделитель");
	ТабДок.Вывести(Разделитель);
	//////////////////////////////////////////////////////  ГЛАВНЫЕ ДОСТИЖЕНИЯ
	Если НЕ ПустаяСтрока(Ссылка.ОпытИДостижения) Тогда
		ДопСв = Макет.ПолучитьОбласть("ДостиженияЗагол");
		ТабДок.Вывести(ДопСв);
		ДопСв = Макет.ПолучитьОбласть("ДостиженияСтр");
		ДопСв.Параметры.Заполнить(Ссылка);
		ТабДок.Вывести(ДопСв);
	КонецЕсли;
	Разделитель = Макет.ПолучитьОбласть("Разделитель");
	ТабДок.Вывести(Разделитель);
	//////////////////////////////////////////////////////  ОБРАЗОВАНИЕ
	ОбразованиеЗагол = Макет.ПолучитьОбласть("ОбразованиеЗагол");
	ТабДок.Вывести(ОбразованиеЗагол);
	ТабДок.Вывести(Разделитель);
	Для каждого Стр Из Ссылка.Образование Цикл
		ОбразованиеСтр = Макет.ПолучитьОбласть("ОбразованиеСтр");
		
		ОбразованиеСтр.Параметры.Заполнить(Стр);
		
		НачГод = Формат(Стр.НачалоОбучения,"ДФ=гггг");
		КонГод = Формат(Стр.КонецОбучения,"ДФ=гггг");
		
		НачМес = Формат(Стр.НачалоОбучения,"ДФ=ММ");
		КонМес = Формат(Стр.КонецОбучения,"ДФ=ММ");
		
		Если ЗначениеЗаполнено(Стр.КонецОбучения) Тогда
			ОбразованиеСтр.Параметры.ПечПериод = НачМес+"."+НачГод+" - "+КонМес+"."+КонГод;
		Иначе
			ОбразованиеСтр.Параметры.ПечПериод = НачМес+"."+НачГод+" - наст. время";
		КонецЕсли;
		
		ТабДок.Вывести(ОбразованиеСтр);
		ТабДок.Вывести(Разделитель);
	КонецЦикла;
	
	ТабДок.Вывести(Разделитель);

	//опыт работы надо выводить в обратном порядке
	ОпытРаботыЗагол = Макет.ПолучитьОбласть("ОпытРаботыЗагол");
	ТабДок.Вывести(ОпытРаботыЗагол);
	ТабДок.Вывести(Разделитель);
	//ТЗ = Новый ТаблицаЗначений;
	ТЗ = Ссылка.ОпытРаботы.Выгрузить();
	ТЗ.Сортировать("НачалоДеятельности Убыв");
	
	Для каждого Стр Из ТЗ Цикл //Ссылка.ОпытРаботы 
		ОпытРаботыСтр = Макет.ПолучитьОбласть("ОпытРаботыСтр");
		ОпытРаботыСтр.Параметры.Заполнить(Стр);
		
		НачГод = Формат(Стр.НачалоДеятельности,"ДФ=гггг");
		КонГод = Формат(Стр.ОкончаниеДеятельности,"ДФ=гггг");
		
		НачМес = Формат(Стр.НачалоДеятельности,"ДФ=ММ");
		КонМес = Формат(Стр.ОкончаниеДеятельности,"ДФ=ММ");
		
		Если ЗначениеЗаполнено(Стр.ОкончаниеДеятельности) Тогда
			ОпытРаботыСтр.Параметры.ПечПериод = НачМес+"."+НачГод+" - "+КонМес+"."+КонГод;
		Иначе
			ОпытРаботыСтр.Параметры.ПечПериод = НачМес+"."+НачГод+" - наст. время";
		КонецЕсли;
		
		ТабДок.Вывести(ОпытРаботыСтр);
		ТабДок.Вывести(Разделитель);
	КонецЦикла;
	
	ТабДок.Вывести(Разделитель);
	
	НавыкиЗагол = Макет.ПолучитьОбласть("НавыкиЗагол");
	ТабДок.Вывести(НавыкиЗагол);
	ТабДок.Вывести(Разделитель);
	Для каждого Стр Из Ссылка.Навыки Цикл
		НавыкиСтр = Макет.ПолучитьОбласть("НавыкиСтр");
		НавыкиСтр.Параметры.Заполнить(Стр);
		ТабДок.Вывести(НавыкиСтр);
		//ТабДок.Вывести(Разделитель);
	КонецЦикла;
	
	ТабДок.Вывести(Разделитель);
	
	ДопСвЗагол = Макет.ПолучитьОбласть("ДопСвЗагол");
	ТабДок.Вывести(ДопСвЗагол);
	ТабДок.Вывести(Разделитель);
	Для каждого Стр Из Ссылка.ДополнительныеСведения Цикл
		ДопСвСтр = Макет.ПолучитьОбласть("ДопСвСтр");
		ДопСвСтр.Параметры.Заполнить(Стр);
		ТабДок.Вывести(ДопСвСтр);
		//ТабДок.Вывести(Разделитель);
	КонецЦикла;
	
КонецПроцедуры

//вызывается из модуля формы документа (из серверной процедуры)
//после печати нужно убрать концевые пробелы из строк:
//скопировать в pspad
//Правка - Строчные операции - Убрать лишние пробелы
Процедура ПечатьРезюмеТекст(ТекстДок, ПараметрКоманды) Экспорт

	Макет = Справочники.Резюме.ПолучитьМакет("МакетТекст");
	Ссылка = ПараметрКоманды.Ссылка;

	ТекущаяОбласть = Макет.ПолучитьОбласть("Шапка");
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.Заполнить(Ссылка);
	Шапка.Параметры.ДатаРождения = Формат(Ссылка.ДатаРождения, "ДЛФ=ДД");
	Шапка.Параметры.ФамилияИмяОтчество = Ссылка.Фамилия+" "+Ссылка.Имя+" "+Ссылка.Отчество;
	ТекстДок.Вывести(Шапка);
	
	ОбразованиеЗагол = Макет.ПолучитьОбласть("ОбразованиеЗагол");
	ТекстДок.Вывести(ОбразованиеЗагол);
	Для каждого Стр Из Ссылка.Образование Цикл
		ОбразованиеСтр = Макет.ПолучитьОбласть("ОбразованиеСтр");
		
		ОбразованиеСтр.Параметры.Заполнить(Стр);
		
		НачГод = Формат(Стр.НачалоОбучения,"ДФ=гггг");
		КонГод = Формат(Стр.КонецОбучения,"ДФ=гггг");
		
		НачМес = Формат(Стр.НачалоОбучения,"ДФ=ММ");
		КонМес = Формат(Стр.КонецОбучения,"ДФ=ММ");
		
		Если ЗначениеЗаполнено(Стр.КонецОбучения) Тогда
			ОбразованиеСтр.Параметры.ПечПериод = НачМес+"."+НачГод+" - "+КонМес+"."+КонГод;
		Иначе
			ОбразованиеСтр.Параметры.ПечПериод = НачМес+"."+НачГод+" - наст. время";
		КонецЕсли;
		
		ТекстДок.Вывести(ОбразованиеСтр);
	КонецЦикла;

	//опыт работы надо выводить в обратном порядке
	ОпытРаботыЗагол = Макет.ПолучитьОбласть("ОпытРаботыЗагол");
	ТекстДок.Вывести(ОпытРаботыЗагол);
	ТЗ = Ссылка.ОпытРаботы.Выгрузить();
	ТЗ.Сортировать("НачалоДеятельности Убыв");
	
	Для каждого Стр Из ТЗ Цикл //Ссылка.ОпытРаботы 
		ОпытРаботыСтр = Макет.ПолучитьОбласть("ОпытРаботыСтр");
		ОпытРаботыСтр.Параметры.Заполнить(Стр);
		
		НачГод = Формат(Стр.НачалоДеятельности,"ДФ=гггг");
		КонГод = Формат(Стр.ОкончаниеДеятельности,"ДФ=гггг");
		
		НачМес = Формат(Стр.НачалоДеятельности,"ДФ=ММ");
		КонМес = Формат(Стр.ОкончаниеДеятельности,"ДФ=ММ");
		
		Если ЗначениеЗаполнено(Стр.ОкончаниеДеятельности) Тогда
			ОпытРаботыСтр.Параметры.ПечПериод = НачМес+"."+НачГод+" - "+КонМес+"."+КонГод;
		Иначе
			ОпытРаботыСтр.Параметры.ПечПериод = НачМес+"."+НачГод+" - наст. время";
		КонецЕсли;
		
		ТекстДок.Вывести(ОпытРаботыСтр);
	КонецЦикла;
	
	НавыкиЗагол = Макет.ПолучитьОбласть("НавыкиЗагол");
	ТекстДок.Вывести(НавыкиЗагол);
	Для каждого Стр Из Ссылка.Навыки Цикл
		НавыкиСтр = Макет.ПолучитьОбласть("НавыкиСтр");
		НавыкиСтр.Параметры.Заполнить(Стр);
		ТекстДок.Вывести(НавыкиСтр);
	КонецЦикла;
	
	ДопСвЗагол = Макет.ПолучитьОбласть("ДопСвЗагол");
	ТекстДок.Вывести(ДопСвЗагол);
	Для каждого Стр Из Ссылка.ДополнительныеСведения Цикл
		ДопСвСтр = Макет.ПолучитьОбласть("ДопСвСтр");
		ДопСвСтр.Параметры.Заполнить(Стр);
		ТекстДок.Вывести(ДопСвСтр);
	КонецЦикла;
	
КонецПроцедуры

//вызывается из модуля формы документа (из серверной процедуры)
//после печати нужно убрать концевые пробелы из строк:
//скопировать в pspad
//Правка - Строчные операции - Убрать лишние пробелы
Процедура ПечатьРезюмеТекст2(ТекстДок, ПараметрКоманды) Экспорт

	Ссылка = ПараметрКоманды.Ссылка;
	
	ТекстДок.ДобавитьСтроку(Ссылка.Фамилия+" "+Ссылка.Имя+" "+Ссылка.Отчество);
	ТекстДок.ДобавитьСтроку(Ссылка.Должность);
	ТекстДок.ДобавитьСтроку("");
	ТекстДок.ДобавитьСтроку("Дата рождения: "+Формат(Ссылка.ДатаРождения,"ДФ=дд.ММ.гггг"));
	ТекстДок.ДобавитьСтроку("Семейное положение: "+Ссылка.СемейноеПоложение);
	ТекстДок.ДобавитьСтроку("Тел.: "+Ссылка.Телефон);
	ТекстДок.ДобавитьСтроку("e-mail: "+Ссылка.email);
	Если Ссылка.ОжидаемаяЗарплата<>0 Тогда
		ТекстДок.ДобавитьСтроку("Примерная зарплата: "+Ссылка.ОжидаемаяЗарплата);
	КонецЕсли;
	ТекстДок.ДобавитьСтроку("");
	Если НЕ ПустаяСтрока(Ссылка.ОпытИДостижения) Тогда
		ТекстДок.ДобавитьСтроку("Главные достижения");
		ТекстДок.ДобавитьСтроку(Ссылка.ОпытИДостижения);
	КонецЕсли;
	ТекстДок.ДобавитьСтроку("");
	ТекстДок.ДобавитьСтроку("Образование");
	Для каждого Стр Из Ссылка.Образование Цикл
		
		НачГод = Формат(Стр.НачалоОбучения,"ДФ=гггг");
		КонГод = Формат(Стр.КонецОбучения,"ДФ=гггг");
		
		НачМес = Формат(Стр.НачалоОбучения,"ДФ=ММ");
		КонМес = Формат(Стр.КонецОбучения,"ДФ=ММ");
		
		Если ЗначениеЗаполнено(Стр.КонецОбучения) Тогда
			ПечПериод = НачМес+"."+НачГод+" - "+КонМес+"."+КонГод;
		Иначе
			ПечПериод = НачМес+"."+НачГод+" - наст. время";
		КонецЕсли;
		
		ТекстДок.ДобавитьСтроку(ПечПериод+Символы.Таб+Стр.УчебноеЗаведение);
		ТекстДок.ДобавитьСтроку("Специальность: "+Стр.Специальность);
	КонецЦикла;
	ТекстДок.ДобавитьСтроку("");
	ТекстДок.ДобавитьСтроку("Профессиональный опыт");
	//опыт работы надо выводить в обратном порядке
	ТЗ = Ссылка.ОпытРаботы.Выгрузить();
	ТЗ.Сортировать("НачалоДеятельности Убыв");
	
	Для каждого Стр Из ТЗ Цикл //Ссылка.ОпытРаботы 
		НачГод = Формат(Стр.НачалоДеятельности,"ДФ=гггг");
		КонГод = Формат(Стр.ОкончаниеДеятельности,"ДФ=гггг");
		
		НачМес = Формат(Стр.НачалоДеятельности,"ДФ=ММ");
		КонМес = Формат(Стр.ОкончаниеДеятельности,"ДФ=ММ");
		
		Если ЗначениеЗаполнено(Стр.ОкончаниеДеятельности) Тогда
			ПечПериод = НачМес+"."+НачГод+" - "+КонМес+"."+КонГод;
		Иначе
			ПечПериод = НачМес+"."+НачГод+" - наст. время";
		КонецЕсли;
		
		ТекстДок.ДобавитьСтроку(ПечПериод+Символы.Таб+Стр.Организация);
		ТекстДок.ДобавитьСтроку("Должность: "+Стр.Должность);
		ТекстДок.ДобавитьСтроку("Обязанности: "+Стр.Обязанности);
	КонецЦикла;
	ТекстДок.ДобавитьСтроку("");
	ТекстДок.ДобавитьСтроку("Ключевые навыки");
	Для каждого Стр Из Ссылка.Навыки Цикл
		ТекстДок.ДобавитьСтроку(Стр.ПрофНавыки);
	КонецЦикла;
	ТекстДок.ДобавитьСтроку("");
	ТекстДок.ДобавитьСтроку("Дополнительные сведения");
	Для каждого Стр Из Ссылка.ДополнительныеСведения Цикл
		ТекстДок.ДобавитьСтроку(Стр.ДопСведения);
	КонецЦикла;
КонецПроцедуры

//вызывается из модуля формы документа (из серверной процедуры)
Процедура ПечатьРезюмеВорд(ПараметрКоманды) Экспорт

	//Макет = Справочники.Резюме.ПолучитьМакет("МакетВорд");
	Ссылка = ПараметрКоманды.Ссылка;
	//МСВорд = Макет.Получить();
	
	МСВорд = Новый COMОбъект("Word.Application");
	Документ = МСВорд.Documents.add();
	Документ.Activate();
	wdFieldDocVariable = 64;// (&H40)
	
	Попытка
		
		ПутьКФайлу = КаталогВременныхФайлов()+"fresume.jpg";
		Картинка = Ссылка.Фото.Получить();
		Если НЕ Картинка = Неопределено Тогда
			Картинка.Записать(ПутьКФайлу);
			Документ.InlineShapes().AddPicture(ПутьКФайлу);
		КонецЕсли;
		
		ДобавитьПоле(Документ, "ФИО", СокрЛП(Ссылка.Фамилия)+" "+СокрЛП(Ссылка.Имя)+" "+СокрЛП(Ссылка.Отчество));
		ДобавитьПоле(Документ, "Должность", Ссылка.Должность);
		Если Ссылка.ОжидаемаяЗарплата<>0 Тогда
			ДобавитьПоле(Документ, "Зарплата", "Ожидаемый уровень дохода: "+СокрЛП(Ссылка.ОжидаемаяЗарплата)+" руб.");
		КонецЕсли;
		ДобавитьПоле(Документ, "Разделитель", " ");
		ДобавитьПоле(Документ, "ДатаРождения", "Дата рождения: "+Формат(Ссылка.ДатаРождения,"ДФ=дд.ММ.гггг"));
		ДобавитьПоле(Документ, "СемейноеПоложение", "Семейное положение: "+СокрЛП(Ссылка.СемейноеПоложение));
		ДобавитьПоле(Документ, "Телефон", "тел.:"+СокрЛП(Ссылка.Телефон));
		ДобавитьПоле(Документ, "Почта", "e-mail: "+СокрЛП(Ссылка.email));
		Если НЕ ПустаяСтрока(Ссылка.ГородПроживания) Тогда
			ДобавитьПоле(Документ, "Город", "Город проживания: "+СокрЛП(Ссылка.ГородПроживания));
		КонецЕсли;
		Если НЕ ПустаяСтрока(Ссылка.РайонПроживания) Тогда
			ДобавитьПоле(Документ, "Район", "Район проживания: "+СокрЛП(Ссылка.РайонПроживания));
		КонецЕсли;
		Если НЕ ПустаяСтрока(Ссылка.СтанцияМетро) Тогда
			ДобавитьПоле(Документ, "Метро", "Станция метро: "+СокрЛП(Ссылка.СтанцияМетро));
		КонецЕсли;
		ДобавитьПоле(Документ, "Разделитель", " ");
		
		////////////////////////////////////////////////////////////  ГЛАВНЫЕ ДОСТИЖЕНИЯ
		Если НЕ ПустаяСтрока(Ссылка.ОпытИДостижения) Тогда
			ДобавитьПоле(Документ, "ГлавныеДостиженияЗаг", "Главные достижения");
			ДобавитьПоле(Документ, "ГлавныеДостижения", СокрЛП(Ссылка.ОпытИДостижения));
		КонецЕсли;
		ДобавитьПоле(Документ, "Разделитель", " ");
	
		////////////////////////////////////////////////////////////  ОБРАЗОВАНИЕ
		Если Ссылка.Образование.Количество()>0 Тогда
			ДобавитьПоле(Документ, "Образование", "Образование");
			сч=1;
			
			myRange = Документ.Range(Документ.Range().End - 1, Документ.Range().End);
			КолСтрок = Ссылка.Образование.Количество()+1;
			КолКолонок = 2;
			Таблица = Документ.Tables.Add(myRange, КолСтрок, КолКолонок);
			Таблица.Columns.First.Width=100;
			Таблица.CELL(1,1).Range.Text = "Период";
			Таблица.CELL(1,2).Range.Text = "Учебное заведение";
			
			Для каждого Стр Из Ссылка.Образование Цикл
				НачГод = Формат(Стр.НачалоОбучения,"ДФ=гггг");
				КонГод = Формат(Стр.КонецОбучения,"ДФ=гггг");
				
				НачМес = Формат(Стр.НачалоОбучения,"ДФ=ММ");
				КонМес = Формат(Стр.КонецОбучения,"ДФ=ММ");
				
				Если ЗначениеЗаполнено(Стр.КонецОбучения) Тогда
					периодстр = НачМес+"."+НачГод+" - "+КонМес+"."+КонГод;
				Иначе
					периодстр = НачМес+"."+НачГод+" - наст. время";
				КонецЕсли;
				
				Таблица.CELL(сч+1,1).Range.Text = СокрЛП(периодстр);
				Таблица.CELL(сч+1,2).Range.Text = СокрЛП(Стр.УчебноеЗаведение)+Символы.ПС+"Специальность: "+СокрЛП(Стр.Специальность);
				
				//ДобавитьПоле(Документ, "Образование"+сч, "Период обучения: "+СокрЛП(периодстр));
				//ДобавитьПоле(Документ, "УчЗаведение"+сч, "Учебное заведение: "+СокрЛП(Стр.УчебноеЗаведение));
				//ДобавитьПоле(Документ, "Специальность"+сч, "Специальность: "+СокрЛП(Стр.Специальность));
				//ДобавитьПоле(Документ, "Разделитель", " ");
				
				сч=сч+1;
			КонецЦикла;
		КонецЕсли;
		ДобавитьПоле(Документ, "Разделитель", " ");
		////////////////////////////////////////////////////////////  ОПЫТ РАБОТЫ
		//опыт работы надо выводить в обратном порядке
		ДобавитьПоле(Документ, "ОпытРаботы", "Профессиональный опыт");
		
		ТЗ = Ссылка.ОпытРаботы.Выгрузить();
		ТЗ.Сортировать("НачалоДеятельности Убыв");
		
		myRange = Документ.Range(Документ.Range().End - 1, Документ.Range().End);
		КолСтрок = Ссылка.ОпытРаботы.Количество()+1;
		КолКолонок = 2;
		Таблица = Документ.Tables.Add(myRange, КолСтрок, КолКолонок);
		Таблица.Columns.First.Width=100;
		Таблица.CELL(1,1).Range.Text = "Период";
		Таблица.CELL(1,2).Range.Text = "Организация, должность";
		
		сч=1;
		Для каждого Стр Из ТЗ Цикл //Ссылка.ОпытРаботы 
			НачГод = Формат(Стр.НачалоДеятельности,"ДФ=гггг");
			КонГод = Формат(Стр.ОкончаниеДеятельности,"ДФ=гггг");
			
			НачМес = Формат(Стр.НачалоДеятельности,"ДФ=ММ");
			КонМес = Формат(Стр.ОкончаниеДеятельности,"ДФ=ММ");
			
			Если ЗначениеЗаполнено(Стр.ОкончаниеДеятельности) Тогда
				ПериодСтр = НачМес+"."+НачГод+" - "+КонМес+"."+КонГод;
			Иначе
				ПериодСтр = НачМес+"."+НачГод+" - наст. время";
			КонецЕсли;
			
			Таблица.CELL(сч+1,1).Range.Text = СокрЛП(периодстр);
			Таблица.CELL(сч+1,2).Range.Text = СокрЛП(Стр.Организация)+Символы.ПС+"Должность: "+СокрЛП(Стр.Должность)+Символы.ПС+" "+Символы.ПС+СокрЛП(Стр.Обязанности);
			
			//ДобавитьПоле(Документ, "РаботаПер"+сч, "Период работы: "+СокрЛП(ПериодСтр));
			//ДобавитьПоле(Документ, "РаботаОрг"+сч, "Организация: "+СокрЛП(Стр.Организация));
			//ДобавитьПоле(Документ, "РаботаДолж"+сч, "Должность: "+СокрЛП(Стр.Должность));
			//ДобавитьПоле(Документ, "РаботаОбяз"+сч, "Обязанности: "+СокрЛП(СтрЗаменить(Стр.Обязанности,"-", Символы.ПС+Символы.ВК)));
			//ДобавитьПоле(Документ, "Разделитель", " ");
			сч=сч+1;
		КонецЦикла;
		ДобавитьПоле(Документ, "Разделитель", " ");
		//////////////////////////////////////////////////////////////  НАВЫКИ
		ДобавитьПоле(Документ, "Навыки", "Ключевые навыки");
		ДобавитьПоле(Документ, "Разделитель", " ");
		сч=1;
		Для каждого Стр Из Ссылка.Навыки Цикл
			//Если НЕ ПустаяСтрока(Стр.ОбластьДеятельности) Тогда
			//	Секция =  Макет.ПолучитьОбласть("НавыкиШапка");
			//	Секция.Параметры.ОбластьДеятельности = СокрЛП(Стр.ОбластьДеятельности);
			//	ТабДок.Вывести(Секция);
			//КонецЕсли;
			ДобавитьПоле(Документ, "Навыки"+сч, СокрЛП(Стр.ПрофНавыки));
			
			сч=сч+1;
		КонецЦикла;
		ДобавитьПоле(Документ, "Разделитель", " ");
		//////////////////////////////////////////////////////////////  ДОПОЛНИТЕЛЬНО
		ДобавитьПоле(Документ, "Дополнительно", "Дополнительные сведения");
		ДобавитьПоле(Документ, "Разделитель", " ");
		сч=1;
		Для каждого Стр Из Ссылка.ДополнительныеСведения Цикл
			ДобавитьПоле(Документ, "ДопСвед"+сч, СокрЛП(Стр.ДопСведения));
			сч=сч+1;
		КонецЦикла;
		
		Документ.Fields.Update();
		МСВорд.Application.Visible = Истина;
		МСВорд.Activate();
	Исключение
		МСВорд.Application.Quit();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
		
КонецПроцедуры

Процедура ДобавитьПоле(ActiveDocument, ИмяПоля, ЗначениеПоля="")
	//wdFieldDocVariable = 64;// (&H40)	  //тип поля - DocVariable
	myRange = ActiveDocument.Range(ActiveDocument.Range().End - 1, ActiveDocument.Range().End);
	myRange.Paragraphs.SpaceAfter = 0;
	Поле 	= ActiveDocument.Fields.Add(myRange, 64, СокрЛП(ИмяПоля), False);
	
	//Если не ПустаяСтрока(ЗначениеПоля) Тогда //- разделитель не вставляется если работает это условие
		ActiveDocument.Variables.Item(СокрЛП(ИмяПоля)).Value = СокрЛП(ЗначениеПоля)+Символы.ПС+Символы.ВК;
	//КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьЗначениеПоля(ActiveDocument, ИмяПоля, ЗначениеПоля)
	
	ActiveDocument.Variables.Item(СокрЛП(ИмяПоля)).Value = СокрЛП(ЗначениеПоля)+Символы.ПС+Символы.ВК;
	
КонецПроцедуры
